source/lesson_0.org
#+TITLE: Lesson 0: How Do I Run Code?
#+AUTHOR: Gabriel Cardozo
#+PROPERTY: header-args :results raw verbatim output :post output_drawer(data=*this*) :noweb strip-export
#+HTML_HEAD: <style>
#+HTML_HEAD: body { background-color:#181825; color:#cdd6f4 }
#+HTML_HEAD: pre { background-color:#11111b }
#+HTML_HEAD: a { color:#89b4fa }
#+HTML_HEAD: ol ol { list-style-type: lower-alpha }
#+HTML_HEAD: </style>

#+NAME: output_drawer
#+BEGIN_SRC shell :var data="" :exports none :results silent :results output :post
echo ':results:'
echo '#+HTML: <details>'
echo '#+HTML: <summary>Output</summary>'
echo '#+BEGIN_SRC'
echo -n "$data"
echo '#+END_SRC'
echo '#+HTML: </details>'
echo ':end:'
#+END_SRC


#+NAME: session_output_drawer
#+BEGIN_SRC shell :var data="" :exports none :results silent :results output :post
echo ':results:'
echo '#+HTML: <details>'
echo '#+HTML: <summary>Output</summary>'
echo '#+BEGIN_SRC'
echo "$data"
echo '#+END_SRC'
echo '#+HTML: </details>'
echo ':end:'
#+END_SRC

Before we even get into learning how to program, we must know - well, how to write programs! Knowing all the syntax in the world is useless if we don't know how to make a script go. This lesson will help you get set up with the basic necessities to write and run code.

* Dependencies
I am assuming that these lessons will be used by people using MacOS.
** Making Sure You Have Python
These lessons are focused on Python, so you'll wanna make sure you have that!

*** Checking if Python is Already Installed
First things first: Let's make sure it is not already installed. Open the terminal and attempt to run the ~python3~ program with the ~--version~ flag:

#+BEGIN_SRC shell :exports both
python3 --version
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Python 3.10.11
#+END_SRC
#+HTML: </details>
:end:

If that command yields results starting with ~Python 3~, then you are done! If not, it's worth trying the ~python~ command instead:

#+BEGIN_SRC shell :exports both
python --version
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Python 3.10.11
#+END_SRC
#+HTML: </details>
:end:

In my case, ~python~ is an alias for ~python3~. If you get an error, or some result starting with ~Python 2~, then you will have to actually install it!

*** Installing Python Via The Official Installer
This one's pretty straightforward. Follow [[https://www.python.org/downloads/macos/][this link]] and download the latest stable release of Python! Or a different one if you want. Your call. As long as it's Python 3 and not Python 2, I am not particularly fussed about it. Run the installer and presto! Return to the terminal and attempt the steps above to be sure it worked.

*** Installing Python Via Homebrew
Homebrew is a fancy package manager that is popular on MacOS (although it also works on Linux!) I do not know any particular reason to use Homebrew instead of the official method for installing Python, but A) it's your computer, who am I to judge, and B) there are a lot of things that I do not know.

Follow [[https://brew.sh/][this link]] for instructions on how to install Homebrew - they will ask you to copy paste a command into the terminal.

Once you have Homebrew installed, you'll need to install python! There are also instructions on how to install software using Homebrew on that page - but we aren't looking to install ~wget~, we want ~python3~! Give ~brew install python3~ a try.

Once that is done, follow the above instructions to check if Python is installed.

** Making Sure You Have a Text Editor
I wrote a lot of stuff here about the different text editor options you could use, but before you spend a lot of time on that, I am going to recommend [[Visual Studio Code][installing Visual Studio Code]]. If you are interested, read on. If not, jump ahead.

*** Idle
If you installed Python using the official method, you should also have the Idle text editor (and Python interpreter environment) installed. While there is nothing wrong with Idle, there isn't much right with it either, and I actually find the way you can use it to run programs a bit confusing. You can open ~.py~ files with Idle and edit them, and will get basic syntax highlighting and possibly autocomplete. If you really want to use Idle I can figure it out with you; it is not the option I recommend.

