lesson_0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-06 Sun 21:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 0: How Do I Run Code?</title>
<meta name="author" content="Gabriel Cardozo" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Inconsolata|Open Sans">
<link rel="stylesheet" href="style.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 0: How Do I Run Code?</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge41b00f">1. Dependencies</a>
<ul>
<li><a href="#orgd6580f0">1.1. Making Sure You Have Python</a>
<ul>
<li><a href="#org55ee500">1.1.1. Checking if Python is Already Installed</a></li>
<li><a href="#orgbaf8e67">1.1.2. Installing Python Via The Official Installer</a></li>
<li><a href="#org4440d56">1.1.3. Installing Python Via Homebrew</a></li>
</ul>
</li>
<li><a href="#org69ec788">1.2. Making Sure You Have a Text Editor</a>
<ul>
<li><a href="#orgfc71b52">1.2.1. Idle</a></li>
<li><a href="#org91673da">1.2.2. A Terminal Editor</a></li>
<li><a href="#orge9a0529">1.2.3. Visual Studio Code</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4904d11">2. Putting it Together</a>
<ul>
<li><a href="#orgc9fd8f2">2.1. Write Some Code</a></li>
<li><a href="#org6a03ba7">2.2. Run Some Code</a>
<ul>
<li><a href="#orgcf19e6c">2.2.1. Running Code In The Terminal</a></li>
<li><a href="#org63e1888">2.2.2. Running Code Using IDE Features</a></li>
<li><a href="#org131d7e7">2.2.3. Running an Executable Script</a></li>
<li><a href="#org24c543d">2.2.4. Using The Interactive Interpreter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcdfe101">3. You Did It!</a></li>
</ul>
</div>
</div>
<p>
Before we even get into learning how to program, we must know - well, how to write programs! Knowing all the syntax in the world is useless if we don&rsquo;t know how to make a script go. This lesson will help you get set up with the basic necessities to write and run code.
</p>

<div id="outline-container-orge41b00f" class="outline-2">
<h2 id="orge41b00f"><span class="section-number-2">1.</span> Dependencies</h2>
<div class="outline-text-2" id="text-1">
<p>
I am assuming that these lessons will be used by people using MacOS.
</p>
</div>
<div id="outline-container-orgd6580f0" class="outline-3">
<h3 id="orgd6580f0"><span class="section-number-3">1.1.</span> Making Sure You Have Python</h3>
<div class="outline-text-3" id="text-1-1">
<p>
These lessons are focused on Python, so you&rsquo;ll wanna make sure you have that!
</p>
</div>

<div id="outline-container-org55ee500" class="outline-4">
<h4 id="org55ee500"><span class="section-number-4">1.1.1.</span> Checking if Python is Already Installed</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
First things first: Let&rsquo;s make sure it is not already installed. Open the terminal and attempt to run the <code>python3</code> program with the <code>--version</code> flag:
</p>

<div class="org-src-container">
<pre class="src src-shell">python3 --version
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">Python 3.11.1
</pre>
</div>
</details>

<p>
If that command yields results starting with <code>Python 3</code>, then you are done! If not, it&rsquo;s worth trying the <code>python</code> command instead:
</p>

<div class="org-src-container">
<pre class="src src-shell">python --version
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">Python 3.11.1
</pre>
</div>
</details>

<p>
In my case, <code>python</code> is an alias for <code>python3</code>. If you get an error, or some result starting with <code>Python 2</code>, then you will have to actually install it!
</p>
</div>
</div>

<div id="outline-container-orgbaf8e67" class="outline-4">
<h4 id="orgbaf8e67"><span class="section-number-4">1.1.2.</span> Installing Python Via The Official Installer</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
This one&rsquo;s pretty straightforward. Follow <a href="https://www.python.org/downloads/macos/">this link</a> and download the latest stable release of Python! Or a different one if you want. Your call. As long as it&rsquo;s Python 3 and not Python 2, I am not particularly fussed about it. Run the installer and presto! Return to the terminal and attempt the steps above to be sure it worked.
</p>
</div>
</div>

<div id="outline-container-org4440d56" class="outline-4">
<h4 id="org4440d56"><span class="section-number-4">1.1.3.</span> Installing Python Via Homebrew</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Homebrew is a fancy package manager that is popular on MacOS (although it also works on Linux!) I do not know any particular reason to use Homebrew instead of the official method for installing Python, but A) it&rsquo;s your computer, who am I to judge, and B) there are a lot of things that I do not know.
</p>

<p>
Follow <a href="https://brew.sh/">this link</a> for instructions on how to install Homebrew - they will ask you to copy paste a command into the terminal.
</p>

<p>
Once you have Homebrew installed, you&rsquo;ll need to install python! There are also instructions on how to install software using Homebrew on that page - but we aren&rsquo;t looking to install <code>wget</code>, we want <code>python3</code>! Give <code>brew install python3</code> a try.
</p>

<p>
Once that is done, follow the above instructions to check if Python is installed.
</p>
</div>
</div>
</div>

<div id="outline-container-org69ec788" class="outline-3">
<h3 id="org69ec788"><span class="section-number-3">1.2.</span> Making Sure You Have a Text Editor</h3>
<div class="outline-text-3" id="text-1-2">
<p>
I wrote a lot of stuff here about the different text editor options you could use, but before you spend a lot of time on that, I am going to recommend <a href="#orge9a0529">installing Visual Studio Code</a>. If you are interested, read on. If not, jump ahead.
</p>
</div>

<div id="outline-container-orgfc71b52" class="outline-4">
<h4 id="orgfc71b52"><span class="section-number-4">1.2.1.</span> Idle</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
If you installed Python using the official method, you should also have the Idle text editor (and Python interpreter environment) installed. While there is nothing wrong with Idle, there isn&rsquo;t much right with it either, and I actually find the way you can use it to run programs a bit confusing. You can open <code>.py</code> files with Idle and edit them, and will get basic syntax highlighting and possibly autocomplete. If you really want to use Idle I can figure it out with you; it is not the option I recommend.
</p>
</div>
</div>
