source/lesson_0.org
*** A Terminal Editor
MacOS already comes with a couple of perfectly fine terminal text editors. If you want, you can use one of them.

The simpler, likely more familiar terminal text editor, is nano. To open, or create, a file using Nano, open the terminal, type the name of the program, and the path of a file you with to open or create:

#+BEGIN_SRC shell :results none :eval never
# For example, Documents/text.txt
nano ~/Documents/test.txt
#+END_SRC

You may use arrow keys to navigate, and typing will insert or delete characters as you might expect, with some exceptions. ~Cmd+C~, ~Cmd+V~, or any similar commands are unlikely to function as they would outside of the terminal.

Nano may not have syntax highlighting or any form of autocomplete. I would not recommend using it. The only real advantages it has are that it is already installed on your computer and it is a standard terminal text editor, which makes it easier to explain how to use.

For example: to quit Nano, enter: ~Ctrl+X~. That's easier for me to explain that how to search through a menu! If you have edited the file you opened, it will ask you whether you want to save; you can press ~y~ or ~n~ to answer that, after which it will exit.

The other preinstalled text editor worth considering is Vim. Vim is very useful, but very complicated. Luckily, it also comes with instructions. To learn to use Vim, enter the ~vimtutor~ command in the terminal. This will open a file in Vim with instructions on how to use it. You may also open a file in vim the same way one might in Nano:

#+BEGIN_SRC shell :results none :eval never
vim ~/Documents/test.txt
#+END_SRC

To exit Vim, press ~Escape~ repeatedly - a couple times should do it - type ~:q!~, and hit ~Enter~. This will exit the file you opened without saving. (If you want to save, type ~:wq~ instead.)

As an aside, Vim is the standard terminal text editor on many computers, which may lead to you being in it without expecting it. If you spend time in the terminal, it may be worth knowing how to exit Vim, regardless of whether you intend to use it.

If you ask, I will teach you how to use Vim, but I do not think that it is necessary. It's a cool text editor, but it has a steep learning curve, and that is probably not how you want to spend your time right now.

*** Visual Studio Code
Following [[https://code.visualstudio.com/download][this link]] should take you to the download page for Visual Studio Code. You'll want to download the appropriate version and install it - pretty straightforward!

It should be a fairly familiar interface. There is [[https://code.visualstudio.com/docs/getstarted/userinterface][documentation]] of such topics as the basic layout of the program and how it is used. If the documentation does not help you, feel free to ask me questions. If and when you make or open a file with the extension ~.py~, it will offer to download some Python addons to make writing python code easier. I recommend doing so.

Visual Studio Code is neat because it's a comfortable graphical text editor with some killer code completion, good syntax highlighting, and a built in terminal. This is the text editor I recommend using. (Unless you want to spend the time to learn Vim, but I do not recommend doing that unless you see yourself writing a lot of unformatted text as a career or hobby.)

* Putting it Together
So you've got a way to write code, and you've got a way to run it! Let's test that out.
** Write Some Code
First, you need a place to put the code. You may want a folder to put code in general in - I usually make a folder called ~code~, in either my user home or in ~Documents~. Create a folder called ~lesson_0~.

If you are using Visual Studio Code, you can use it to open that folder. If you are using a terminal text editor, you probably want to navigate the terminal to that folder, using the ~cd~ change directory command.

Now, create a file called ~lesson_0.py~ in that folder. We're going to make a simple "Hello World" script! The purpose of this tradition is making sure we know how to run a program, on whatever system or in whatever language we are using. In Python, it's pretty straightforward. Write the following code into the file:

#+NAME: hello world
#+BEGIN_SRC python :results output :tangle lesson_0.py
<<shebang>>
print("Hello World!")
#+END_SRC

#+RESULTS: hello world
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Hello World!
#+END_SRC
#+HTML: </details>
:end:

** Run Some Code
Now, the moment of truth! Does the code run? How do we even figure that out?

*** Running Code In The Terminal
One of the methods I recommend using, which will basically always work, is via the terminal. If you are in Visual Studio Code, find the terminal tab. It should be open in the same folder as your source code. If you are using a terminal text editor, save out of the file and you should be in the terminal at the same location. Enter the following command:

#+BEGIN_SRC shell :exports both :post output_drawer(data=*this*) :results raw verbatim output
python3 lesson_0.py
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Hello World!
#+END_SRC
#+HTML: </details>
:end:

If the output is as above, congrats! You have run a python script!

*** Running Code Using IDE Features
In Visual Studio Code, there should be a green play button somewhere. Clicking it should run the program. There should also be a keyboard shortcut to do the same thing - hovering over the button should tell you what it is. Give it a try!

I think it is useful to know how to run a Python script through the terminal, regardless of whether the green play button works, because it may not always be avaliable. Frankly, I just do not want to troubleshoot it if it doesn't work. That said, it's a neat and useful feature - feel free to use it if it works for you!

Idle also has some integrated method to run code - I believe in the sucker tree menu up top. I find the way it does this confusing. We can figure it out if we must.

