lesson_0.html

<div id="outline-container-org91673da" class="outline-4">
<h4 id="org91673da"><span class="section-number-4">1.2.2.</span> A Terminal Editor</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
MacOS already comes with a couple of perfectly fine terminal text editors. If you want, you can use one of them.
</p>

<p>
The simpler, likely more familiar terminal text editor, is nano. To open, or create, a file using Nano, open the terminal, type the name of the program, and the path of a file you with to open or create:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #6c7086;"># </span><span style="color: #6c7086;">For example, Documents/text.txt</span>
nano ~/Documents/test.txt
</pre>
</div>

<p>
You may use arrow keys to navigate, and typing will insert or delete characters as you might expect, with some exceptions. <code>Cmd+C</code>, <code>Cmd+V</code>, or any similar commands are unlikely to function as they would outside of the terminal.
</p>

<p>
Nano may not have syntax highlighting or any form of autocomplete. I would not recommend using it. The only real advantages it has are that it is already installed on your computer and it is a standard terminal text editor, which makes it easier to explain how to use.
</p>

<p>
For example: to quit Nano, enter: <code>Ctrl+X</code>. That&rsquo;s easier for me to explain that how to search through a menu! If you have edited the file you opened, it will ask you whether you want to save; you can press <code>y</code> or <code>n</code> to answer that, after which it will exit.
</p>

<p>
The other preinstalled text editor worth considering is Vim. Vim is very useful, but very complicated. Luckily, it also comes with instructions. To learn to use Vim, enter the <code>vimtutor</code> command in the terminal. This will open a file in Vim with instructions on how to use it. You may also open a file in vim the same way one might in Nano:
</p>

<div class="org-src-container">
<pre class="src src-shell">vim ~/Documents/test.txt
</pre>
</div>

<p>
To exit Vim, press <code>Escape</code> repeatedly - a couple times should do it - type <code>:q!</code>, and hit <code>Enter</code>. This will exit the file you opened without saving. (If you want to save, type <code>:wq</code> instead.)
</p>

<p>
As an aside, Vim is the standard terminal text editor on many computers, which may lead to you being in it without expecting it. If you spend time in the terminal, it may be worth knowing how to exit Vim, regardless of whether you intend to use it.
</p>

<p>
If you ask, I will teach you how to use Vim, but I do not think that it is necessary. It&rsquo;s a cool text editor, but it has a steep learning curve, and that is probably not how you want to spend your time right now.
</p>
</div>
</div>

<div id="outline-container-orge9a0529" class="outline-4">
<h4 id="orge9a0529"><span class="section-number-4">1.2.3.</span> Visual Studio Code</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Following <a href="https://code.visualstudio.com/download">this link</a> should take you to the download page for Visual Studio Code. You&rsquo;ll want to download the appropriate version and install it - pretty straightforward!
</p>

<p>
It should be a fairly familiar interface. There is <a href="https://code.visualstudio.com/docs/getstarted/userinterface">documentation</a> of such topics as the basic layout of the program and how it is used. If the documentation does not help you, feel free to ask me questions. If and when you make or open a file with the extension <code>.py</code>, it will offer to download some Python addons to make writing python code easier. I recommend doing so.
</p>

<p>
Visual Studio Code is neat because it&rsquo;s a comfortable graphical text editor with some killer code completion, good syntax highlighting, and a built in terminal. This is the text editor I recommend using. (Unless you want to spend the time to learn Vim, but I do not recommend doing that unless you see yourself writing a lot of unformatted text as a career or hobby.)
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4904d11" class="outline-2">
<h2 id="org4904d11"><span class="section-number-2">2.</span> Putting it Together</h2>
<div class="outline-text-2" id="text-2">
<p>
So you&rsquo;ve got a way to write code, and you&rsquo;ve got a way to run it! Let&rsquo;s test that out.
</p>
</div>
<div id="outline-container-orgc9fd8f2" class="outline-3">
<h3 id="orgc9fd8f2"><span class="section-number-3">2.1.</span> Write Some Code</h3>
<div class="outline-text-3" id="text-2-1">
<p>
First, you need a place to put the code. You may want a folder to put code in general in - I usually make a folder called <code>code</code>, in either my user home or in <code>Documents</code>. Create a folder called <code>lesson_0</code>.
</p>

<p>
If you are using Visual Studio Code, you can use it to open that folder. If you are using a terminal text editor, you probably want to navigate the terminal to that folder, using the <code>cd</code> change directory command.
</p>

<p>
Now, create a file called <code>lesson_0.py</code> in that folder. We&rsquo;re going to make a simple &ldquo;Hello World&rdquo; script! The purpose of this tradition is making sure we know how to run a program, on whatever system or in whatever language we are using. In Python, it&rsquo;s pretty straightforward. Write the following code into the file:
</p>

<div class="org-src-container">
<pre class="src src-python" id="orge28595b">
<span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"Hello World!"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a03ba7" class="outline-3">
<h3 id="org6a03ba7"><span class="section-number-3">2.2.</span> Run Some Code</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Now, the moment of truth! Does the code run? How do we even figure that out?
</p>
</div>

<div id="outline-container-orgcf19e6c" class="outline-4">
<h4 id="orgcf19e6c"><span class="section-number-4">2.2.1.</span> Running Code In The Terminal</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
One of the methods I recommend using, which will basically always work, is via the terminal. If you are in Visual Studio Code, find the terminal tab. It should be open in the same folder as your source code. If you are using a terminal text editor, save out of the file and you should be in the terminal at the same location. Enter the following command:
</p>

<div class="org-src-container">
<pre class="src src-shell">python3 lesson_0.py
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">Hello World!
</pre>
</div>
</details>

<p>
If the output is as above, congrats! You have run a python script!
</p>
</div>
</div>

<div id="outline-container-org63e1888" class="outline-4">
<h4 id="org63e1888"><span class="section-number-4">2.2.2.</span> Running Code Using IDE Features</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
In Visual Studio Code, there should be a green play button somewhere. Clicking it should run the program. There should also be a keyboard shortcut to do the same thing - hovering over the button should tell you what it is. Give it a try!
</p>

<p>
I think it is useful to know how to run a Python script through the terminal, regardless of whether the green play button works, because it may not always be avaliable. Frankly, I just do not want to troubleshoot it if it doesn&rsquo;t work. That said, it&rsquo;s a neat and useful feature - feel free to use it if it works for you!
</p>

<p>
Idle also has some integrated method to run code - I believe in the sucker tree menu up top. I find the way it does this confusing. We can figure it out if we must.
</p>
</div>
</div>
