source/lesson_0.org
*** Running an Executable Script
There's another interesting way to run a Python script - you can make it an executable! First, you need to add what is known as a "shebang" at the very very start of the file:

#+NAME: shebang
#+BEGIN_SRC python :exports code :results none
#!/usr/bin/env python3
#+END_SRC

The shebang tells the computer how to run the executable. Your text editor may have inserted one automatically when you created a ~.py~ file. If it did, it may also look like the following:

#+NAME: alt shebang
#+BEGIN_SRC python :exports code :results none
#!/usr/bin/python3
#+END_SRC

That shebang is slightly less likely to work across a variety of systems, but probably fine. If you don't care to change it, I don't blame you.

Then, enter the terminal. The following commands CHange the MODe of a file to eXecutable, and execute the file, respectively:

#+TODO: Something to do with how noweb, tangle, and exporting interact isn't working
#+BEGIN_SRC shell :export code
chmod +x lesson_0.py # all lowercase
./lesson_0.py
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Hello World!
#+END_SRC
#+HTML: </details>
:end:

You may also be able to execute the program by double clicking on it in Finder. While in this instance that is not likely to be very useful, it's fun to know about, and if you make more complex or useful programs in the future it may come in handy.
*** Using The Interactive Interpreter
This last method of running Python code is a little different. Rather than writing a source code file and running it, you can open the interpreter in an interactive mode. In this mode, you can enter lines of code one at a time, and see what they do immediately.

There are two ways to enter the interactive interpreter. The first way is to run the ~python3~ command with no arguments. The results should look something like the following:

#+BEGIN_SRC sh :results none silent :post
$ python3
Python 3.10.11 (main, Apr  4 2023, 22:10:32) [GCC 12.2.0] on linux
Type "help", "copyright", "credits" or "license" for more information.
>>>
#+END_SRC

You should be able to type after the ~>>>~. There, you may enter lines of Python which will be run immediately. Give it a shot!

#+BEGIN_SRC python :exports both
print("Hello Interpreter!")
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
Hello Interpreter!
#+END_SRC
#+HTML: </details>
:end:

If you enter lines of code which do not print anything ordinarily, but evaluate to a result, the interpreter will print the result of that evaluation. (More on evaluation when we get to actual lessons!)

#+BEGIN_SRC python :exports both :results value :session :post session_output_drawer(data=*this*)
1 + 2 * 3 - 4
#+END_SRC

#+RESULTS:
:results:
#+HTML: <details>
#+HTML: <summary>Output</summary>
#+BEGIN_SRC
3
#+END_SRC
#+HTML: </details>
:end:

You may also run the Python interpreter in interactive mode by passing it the ~-i~ interactive flag. This allows you to run source code files, but stay in interactive mode after they run, by running them like so: ~python3 -i lesson_0.py~.

The interactive interpreter is useful for exploring how the language works. I recommend tinkering with it whenever you wonder what a line of code will do.

* You Did It!
By following these instructions you should be able to get set up to write and run python scripts in a comfortable way on your computer! These instructions will be useful for every other Python lesson you will encounter. While you may end up using Python in some application that uses a different process, this method provides a standard environment that will make it easy to learn, and easy to teach.
