lesson_0.html

<div id="outline-container-org131d7e7" class="outline-4">
<h4 id="org131d7e7"><span class="section-number-4">2.2.3.</span> Running an Executable Script</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
There&rsquo;s another interesting way to run a Python script - you can make it an executable! First, you need to add what is known as a &ldquo;shebang&rdquo; at the very very start of the file:
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgce68d98"><span style="color: #6c7086;">#</span><span style="color: #6c7086;">!/usr/bin/env python3</span>
</pre>
</div>

<p>
The shebang tells the computer how to run the executable. Your text editor may have inserted one automatically when you created a <code>.py</code> file. If it did, it may also look like the following:
</p>

<div class="org-src-container">
<pre class="src src-python" id="org096dc98"><span style="color: #6c7086;">#</span><span style="color: #6c7086;">!/usr/bin/python3</span>
</pre>
</div>

<p>
That shebang is slightly less likely to work across a variety of systems, but probably fine. If you don&rsquo;t care to change it, I don&rsquo;t blame you.
</p>

<p>
Then, enter the terminal. The following commands CHange the MODe of a file to eXecutable, and execute the file, respectively:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #f9e2af;">chmod</span> +x lesson_0.py <span style="color: #6c7086;"># </span><span style="color: #6c7086;">all lowercase</span>
./lesson_0.py
</pre>
</div>

<p>
You may also be able to execute the program by double clicking on it in Finder. While in this instance that is not likely to be very useful, it&rsquo;s fun to know about, and if you make more complex or useful programs in the future it may come in handy.
</p>
</div>
</div>
<div id="outline-container-org24c543d" class="outline-4">
<h4 id="org24c543d"><span class="section-number-4">2.2.4.</span> Using The Interactive Interpreter</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
This last method of running Python code is a little different. Rather than writing a source code file and running it, you can open the interpreter in an interactive mode. In this mode, you can enter lines of code one at a time, and see what they do immediately.
</p>

<p>
There are two ways to enter the interactive interpreter. The first way is to run the <code>python3</code> command with no arguments. The results should look something like the following:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ python3
Python 3.10.11 <span style="color: #f38ba8;">(</span>main, Apr  <span style="color: #fab387;">4</span> 2023, 22:10:32<span style="color: #f38ba8;">)</span> <span style="color: #f38ba8;">[</span>GCC 12.2.0<span style="color: #f38ba8;">]</span> on linux
Type <span style="color: #a6e3a1;">"help"</span>, <span style="color: #a6e3a1;">"copyright"</span>, <span style="color: #a6e3a1;">"credits"</span> or <span style="color: #a6e3a1;">"license"</span> for more information.
&gt;&gt;&gt;
</pre>
</div>

<p>
You should be able to type after the <code>&gt;&gt;&gt;</code>. There, you may enter lines of Python which will be run immediately. Give it a shot!
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #f38ba8;">print</span>(<span style="color: #a6e3a1;">"Hello Interpreter!"</span>)
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">Hello Interpreter!
</pre>
</div>
</details>

<p>
If you enter lines of code which do not print anything ordinarily, but evaluate to a result, the interpreter will print the result of that evaluation. (More on evaluation when we get to actual lessons!)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fab387;">1</span> + <span style="color: #fab387;">2</span> * <span style="color: #fab387;">3</span> - <span style="color: #fab387;">4</span>
</pre>
</div>

<details>
<summary>Output</summary>
<div class="org-src-container">
<pre class="src src-nil">3
</pre>
</div>
</details>

<p>
You may also run the Python interpreter in interactive mode by passing it the <code>-i</code> interactive flag. This allows you to run source code files, but stay in interactive mode after they run, by running them like so: <code>python3 -i lesson_0.py</code>.
</p>

<p>
The interactive interpreter is useful for exploring how the language works. I recommend tinkering with it whenever you wonder what a line of code will do.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgcdfe101" class="outline-2">
<h2 id="orgcdfe101"><span class="section-number-2">3.</span> You Did It!</h2>
<div class="outline-text-2" id="text-3">
<p>
By following these instructions you should be able to get set up to write and run python scripts in a comfortable way on your computer! These instructions will be useful for every other Python lesson you will encounter. While you may end up using Python in some application that uses a different process, this method provides a standard environment that will make it easy to learn, and easy to teach.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Gabriel Cardozo</p>
<p class="date">Created: 2023-08-06 Sun 21:40</p>
</div>
</body>
</html>